import React from 'react';
// import React, { useEffect, useCallback, useState } from 'react';
// import { useHttp } from '../hooks/http.hook';
// import { WordFormChange } from './WordFormChange';
// import { useMessage } from '../hooks/message.hook';
// import { Loader } from './Loader';

import { Link, useHistory } from 'react-router-dom';
import book_black from '../../src/img/book_black.svg';
import bulb_black from '../../src/img/bulb_black.svg';
import letter_black from '../../src/img/letter_black.svg';
import close_book_black from '../../src/img/close_book_black.svg';
import check_black from '../../src/img/check_black.svg';
import check_round_black from '../../src/img/check_round_black.svg';
import two_users_black from '../../src/img/two_users_black.svg';
import user_black from '../../src/img/user_black.svg';
import arrow_black from '../../src/img/arrow_black.svg';
import envelope_white from '../../src/img/envelope_white.svg';

export const MainPage = () => {

    return (
        <>
            <header className="o-header --th-simple">
                <div className="container o-header__inner">
                    <div className="o-header__logo">
                        <svg className="icon" viewBox="0 0 24 24" fill="none">
                            <path
                                d="M22.4142 22.4104C20.3099 24.5299 16.8829 24.5299 14.77 22.4104C14.435 22.0757 14.2289 21.7839 14.0828 21.5694C12.4939 19.1152 14.1516 17.073 12.7773 14.4043C12.2963 13.4689 11.6006 12.7653 11.3945 12.5593C11.1883 12.3534 10.4067 11.5811 9.35027 11.0748C6.63613 9.76192 4.65205 11.3837 2.29865 9.77908C2.11828 9.65895 1.8692 9.47016 1.57717 9.17841C-0.527152 7.05889 -0.527152 3.62648 1.58576 1.50696C3.91339 -0.827077 7.79565 -0.149175 9.23003 1.50696C9.40181 1.70433 9.4877 1.86737 9.66807 2.18487C11.2055 5.00803 9.89997 6.72423 11.1626 9.28996C11.6779 10.3454 12.3908 11.0662 12.6485 11.3151C12.9061 11.5725 13.6706 12.3276 14.7442 12.8339C17.4498 14.1039 19.3995 12.5508 21.7013 14.1382C21.8817 14.2584 22.1222 14.4472 22.4228 14.7389C24.5272 16.8499 24.5272 20.2908 22.4142 22.4104Z"
                                fill="url(#paint0_linear_4009_3568)"
                            />
                            <path
                                d="M18.4269 11.1429C21.5039 11.1429 23.9983 8.64844 23.9983 5.57143C23.9983 2.49441 21.5039 0 18.4269 0C15.3499 0 12.8555 2.49441 12.8555 5.57143C12.8555 8.64844 15.3499 11.1429 18.4269 11.1429Z"
                                fill="#DAFB59"
                            />
                            <path
                                d="M5.57143 24.0003C8.64844 24.0003 11.1429 21.5059 11.1429 18.4288C11.1429 15.3518 8.64844 12.8574 5.57143 12.8574C2.49441 12.8574 0 15.3518 0 18.4288C0 21.5059 2.49441 24.0003 5.57143 24.0003Z"
                                fill="#F6F6F1"
                            />
                            <defs>
                                <linearGradient
                                    id="paint0_linear_4009_3568"
                                    x1="11.6624"
                                    y1="-5.08184"
                                    x2="13.1863"
                                    y2="71.0581"
                                    gradientUnits="userSpaceOnUse"
                                >
                                    <stop offset="0.0729" stopColor="#DAFB59" />
                                    <stop offset="0.1024" stopColor="#D1F860" />
                                    <stop offset="0.1499" stopColor="#BAEE72" />
                                    <stop offset="0.2097" stopColor="#93DF8F" />
                                    <stop offset="0.2792" stopColor="#5DCAB8" />
                                    <stop offset="0.3561" stopColor="#19B0EC" />
                                    <stop offset="0.3825" stopColor="#00A6FF" />
                                </linearGradient>
                            </defs>
                        </svg>
                        <span>Learnew</span>
                    </div>
                    <div className="o-header__actions">
                        <a className="o-header__login">
                            <svg className="icon" viewBox="0 0 24 24" fill="none">
                                <path
                                    d="M7 17V18C7 18.2652 7.10536 18.5196 7.29289 18.7071C7.48043 18.8946 7.73478 19 8 19H16C16.2652 19 16.5196 18.8946 16.7071 18.7071C16.8946 18.5196 17 18.2652 17 18V17C17 16.2044 16.6839 15.4413 16.1213 14.8787C15.5587 14.3161 14.7956 14 14 14H10C9.20435 14 8.44129 14.3161 7.87868 14.8787C7.31607 15.4413 7 16.2044 7 17ZM15 8C15 8.79565 14.6839 9.55871 14.1213 10.1213C13.5587 10.6839 12.7956 11 12 11C11.2044 11 10.4413 10.6839 9.87868 10.1213C9.31607 9.55871 9 8.79565 9 8C9 7.20435 9.31607 6.44129 9.87868 5.87868C10.4413 5.31607 11.2044 5 12 5C12.7956 5 13.5587 5.31607 14.1213 5.87868C14.6839 6.44129 15 7.20435 15 8Z"
                                    stroke="#F6F6F1"
                                    strokeWidth={2}
                                />
                            </svg>
                            <span>Войти</span>
                        </a>
                        <button className="o-header__registration btn btn-green">
                            Зарегистрироваться
                        </button>
                    </div>
                </div>
            </header>
            <main className="o-main">
                <div className="container">
                    <div className="o-main__grid-8">
                        <div className="board-link --th-fill-red">
                            <svg className="board-link__icon" viewBox="0 0 16 16" fill="none">
                                <path
                                    d="M-1.66559e-06 13.2346L2.70532 16L12.1738 6.32112L12.1738 15.6839L16 15.6839L16 3.91093L16 0L12.1738 -3.345e-07L0.657091 -1.34132e-06L0.65709 3.91092L9.12057 3.91093L-1.66559e-06 13.2346Z"
                                    fill="currentColor"
                                />
                            </svg>
                            {/* <a href="#" className="board-link__elem">
                                Регистрация
                            </a> */}
                            <Link className="board-link__elem" to="/registration">Регистрация</Link>
                        </div>
                        <div className="board-link --th-fill-white">
                            <svg className="board-link__icon" viewBox="0 0 16 16" fill="none">
                                <path
                                    d="M-1.66559e-06 13.2346L2.70532 16L12.1738 6.32112L12.1738 15.6839L16 15.6839L16 3.91093L16 0L12.1738 -3.345e-07L0.657091 -1.34132e-06L0.65709 3.91092L9.12057 3.91093L-1.66559e-06 13.2346Z"
                                    fill="currentColor"
                                />
                            </svg>
                            {/* <a href="#" className="board-link__elem">
                                Вход
                            </a> */}
                            <Link className="board-link__elem" to="/authorization">Вход</Link>
                        </div>
                    </div>
                    <div className="o-main__grid-1">
                        <div className="o-main__grid-2">
                            <div className="green-board">
                                <div className="green-board__top">
                                    <h1 className="green-board__title">
                                        Словарь, заметки, <br className="tb-inline" /> квизы —{" "}
                                        <br className="tb-hide" />{" "}
                                        <span className="tb-inline">учите язык</span>{" "}
                                        <span className="bg">
                                            <span className="tb-hide">учите язык</span> легко
                                        </span>
                                    </h1>
                                </div>
                                <Link className="green-board__link" to="/authorization">
                                    <span>Начать учиться</span>
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M19 12H5M19 12L15 16M19 12L15 8"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg></Link>
                                {/* <a href="#" className="green-board__link">
                                    <span>Начать учиться</span>
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M19 12H5M19 12L15 16M19 12L15 8"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                </a> */}
                            </div>
                            <div className="o-main__grid-3 tb-hide">
                                <div className="image-board" />
                                <div className="o-main__grid-4">
                                    <div className="board-link --th-fill-red">
                                        <svg
                                            className="board-link__icon"
                                            viewBox="0 0 16 16"
                                            fill="none"
                                        >
                                            <path
                                                d="M-1.66559e-06 13.2346L2.70532 16L12.1738 6.32112L12.1738 15.6839L16 15.6839L16 3.91093L16 0L12.1738 -3.345e-07L0.657091 -1.34132e-06L0.65709 3.91092L9.12057 3.91093L-1.66559e-06 13.2346Z"
                                                fill="currentColor"
                                            />
                                        </svg>
                                        <Link className="board-link__elem" to="/registration">Регистрация</Link>
                                        {/* <a href="#" className="board-link__elem">
                                            Регистрация
                                        </a> */}
                                    </div>
                                    <div className="board-link --th-fill-stroke">
                                        <svg
                                            className="board-link__icon"
                                            viewBox="0 0 24 24"
                                            fill="none"
                                        >
                                            <path
                                                d="M3.5 5.5L11.393 11.536C11.5673 11.6692 11.7806 11.7413 12 11.7413C12.2194 11.7413 12.4327 11.6692 12.607 11.536L20.5 5.5M4 19H20C20.2652 19 20.5196 18.8946 20.7071 18.7071C20.8946 18.5196 21 18.2652 21 18V6C21 5.73478 20.8946 5.48043 20.7071 5.29289C20.5196 5.10536 20.2652 5 20 5H4C3.73478 5 3.48043 5.10536 3.29289 5.29289C3.10536 5.48043 3 5.73478 3 6V18C3 18.2652 3.10536 18.5196 3.29289 18.7071C3.48043 18.8946 3.73478 19 4 19Z"
                                                stroke="currentColor"
                                                strokeWidth={2}
                                                strokeLinecap="round"
                                            />
                                        </svg>
                                        <Link className="board-link__elem" to="/">Обратная связь</Link>
                                        {/* <a href="#" className="board-link__elem">
                                            Обратная связь
                                        </a> */}
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div className="white-board tb-hide">
                            <p className="white-board__text">
                                Храните слова, записывайте грамматику, <br /> создавайте задания и
                                проходите квизы. <br /> <br /> Всё необходимое для изучения языка{" "}
                                <br /> в одном месте.{" "}
                            </p>
                            <ul className="white-board__list">
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M12 6.02988V19.0299M12 6.02988C9.181 5.19888 7.285 4.95388 3.97101 5.00688C3.71123 5.01186 3.46382 5.11878 3.28217 5.30455C3.10051 5.49032 2.99917 5.74006 3.00001 5.99988V16.9999C3.00001 17.5629 3.46601 18.0139 4.03001 18.0069C7.15201 17.9639 9.048 18.2189 12 19.0299M12 6.02988C14.819 5.19888 16.715 4.95388 20.029 5.00688C20.2888 5.01186 20.5362 5.11878 20.7178 5.30455C20.8995 5.49032 21.0008 5.74006 21 5.99988V16.9999C21 17.5629 20.534 18.0139 19.97 18.0069C16.848 17.9639 14.952 18.2189 12 19.0299"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Словарь</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M9 9C9 8.20435 9.31607 7.44129 9.87868 6.87868C10.4413 6.31607 11.2044 6 12 6M10 21H14M14 18C14 13.9 18 13.1 18 9C18 7.4087 17.3679 5.88258 16.2426 4.75736C15.1174 3.63214 13.5913 3 12 3C10.4087 3 8.88258 3.63214 7.75736 4.75736C6.63214 5.88258 6 7.4087 6 9C6 13 10 14 10 18H14Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Квиз</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M3 6.2V5H14V6.2M8 5V19M5 19H11M13 12.2V11H21V12.2M17 11V19M15.5 19H18.5"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Грамматика</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M5 19V4C5 3.73478 5.10536 3.48043 5.29289 3.29289C5.48043 3.10536 5.73478 3 6 3H18C18.2652 3 18.5196 3.10536 18.7071 3.29289C18.8946 3.48043 19 3.73478 19 4V17H7C6.46957 17 5.96086 17.2107 5.58579 17.5858C5.21071 17.9609 5 18.4696 5 19ZM5 19C5 19.5304 5.21071 20.0391 5.58579 20.4142C5.96086 20.7893 6.46957 21 7 21H19M9 3V17M16 17V21"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Заметки</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M8.0322 12.0002L10.0162 13.9842L14.9762 9.02418M19.5262 14.2962L20.4192 13.4032C20.6035 13.2189 20.7496 13.0002 20.8493 12.7595C20.9491 12.5188 21.0004 12.2607 21.0004 12.0002C21.0004 11.7396 20.9491 11.4816 20.8493 11.2409C20.7496 11.0001 20.6035 10.7814 20.4192 10.5972L19.5262 9.70418C19.342 9.51993 19.1958 9.30119 19.0962 9.06046C18.9965 8.81974 18.9452 8.56173 18.9452 8.30118V7.04018C18.9452 6.51399 18.7362 6.00935 18.3641 5.63728C17.992 5.2652 17.4874 5.05618 16.9612 5.05618H15.6992C15.4386 5.05626 15.1806 5.00499 14.9399 4.9053C14.6991 4.8056 14.4804 4.65945 14.2962 4.47518L13.4032 3.58218C13.219 3.39792 13.0002 3.25175 12.7595 3.15203C12.5188 3.0523 12.2608 3.00098 12.0002 3.00098C11.7396 3.00098 11.4816 3.0523 11.2409 3.15203C11.0002 3.25175 10.7814 3.39792 10.5972 3.58218L9.7042 4.47518C9.51995 4.6594 9.30121 4.80553 9.06049 4.90522C8.81976 5.00491 8.56175 5.0562 8.3012 5.05618H7.0402C6.77957 5.05605 6.52147 5.10727 6.28065 5.20691C6.03982 5.30656 5.82099 5.45268 5.63665 5.63692C5.45232 5.82117 5.30609 6.03993 5.20632 6.2807C5.10655 6.52148 5.0552 6.77955 5.0552 7.04018V8.30218C5.0552 8.82918 4.8462 9.33318 4.4742 9.70518L3.5812 10.5982C3.39694 10.7824 3.25077 11.0011 3.15105 11.2419C3.05133 11.4826 3 11.7406 3 12.0012C3 12.2617 3.05133 12.5198 3.15105 12.7605C3.25077 13.0012 3.39694 13.2199 3.5812 13.4042L4.4742 14.2972C4.8462 14.6692 5.0552 15.1732 5.0552 15.7002V16.9622C5.0552 17.4884 5.26423 17.993 5.6363 18.3651C6.00837 18.7372 6.51301 18.9462 7.0392 18.9462H8.3012C8.8282 18.9462 9.3322 19.1552 9.7042 19.5272L10.5972 20.4202C10.7814 20.6044 11.0002 20.7506 11.2409 20.8503C11.4816 20.9501 11.7396 21.0014 12.0002 21.0014C12.2608 21.0014 12.5188 20.9501 12.7595 20.8503C13.0002 20.7506 13.219 20.6044 13.4032 20.4202L14.2962 19.5272C14.6684 19.1552 15.173 18.9462 15.6992 18.9462H16.9612C17.4874 18.9462 17.992 18.7372 18.3641 18.3651C18.7362 17.993 18.9452 17.4884 18.9452 16.9622V15.7002C18.9452 15.1732 19.1542 14.6682 19.5262 14.2962Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Задания</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M8.5 11.5L11 14L15 10M21 12C21 13.1819 20.7672 14.3522 20.3149 15.4442C19.8626 16.5361 19.1997 17.5282 18.364 18.364C17.5282 19.1997 16.5361 19.8626 15.4442 20.3149C14.3522 20.7672 13.1819 21 12 21C10.8181 21 9.64778 20.7672 8.55585 20.3149C7.46392 19.8626 6.47177 19.1997 5.63604 18.364C4.80031 17.5282 4.13738 16.5361 3.68508 15.4442C3.23279 14.3522 3 13.1819 3 12C3 9.61305 3.94821 7.32387 5.63604 5.63604C7.32387 3.94821 9.61305 3 12 3C14.3869 3 16.6761 3.94821 18.364 5.63604C20.0518 7.32387 21 9.61305 21 12Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>В своём темпе</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M16 19H20C20.2652 19 20.5196 18.8946 20.7071 18.7071C20.8946 18.5196 21 18.2652 21 18V17C21 16.2044 20.6839 15.4413 20.1213 14.8787C19.5587 14.3161 18.7956 14 18 14H16M13.764 10C14.1691 10.4529 14.7021 10.7721 15.2925 10.9154C15.8829 11.0587 16.503 11.0193 17.0705 10.8025C17.6381 10.5857 18.1265 10.2017 18.471 9.70126C18.8156 9.20083 19.0001 8.60758 19.0001 8C19.0001 7.39243 18.8156 6.79917 18.471 6.29874C18.1265 5.7983 17.6381 5.41428 17.0705 5.19748C16.503 4.98069 15.8829 4.94134 15.2925 5.08464C14.7021 5.22794 14.1691 5.54714 13.764 6M3 18V17C3 16.2044 3.31607 15.4413 3.87868 14.8787C4.44129 14.3161 5.20435 14 6 14H10C10.7956 14 11.5587 14.3161 12.1213 14.8787C12.6839 15.4413 13 16.2044 13 17V18C13 18.2652 12.8946 18.5196 12.7071 18.7071C12.5196 18.8946 12.2652 19 12 19H4C3.73478 19 3.48043 18.8946 3.29289 18.7071C3.10536 18.5196 3 18.2652 3 18ZM11 8C11 8.79565 10.6839 9.55871 10.1213 10.1213C9.55871 10.6839 8.79565 11 8 11C7.20435 11 6.44129 10.6839 5.87868 10.1213C5.31607 9.55871 5 8.79565 5 8C5 7.20435 5.31607 6.44129 5.87868 5.87868C6.44129 5.31607 7.20435 5 8 5C8.79565 5 9.55871 5.31607 10.1213 5.87868C10.6839 6.44129 11 7.20435 11 8Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                        />
                                    </svg>
                                    <span>С учителем</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M7 17V18C7 18.2652 7.10536 18.5196 7.29289 18.7071C7.48043 18.8946 7.73478 19 8 19H16C16.2652 19 16.5196 18.8946 16.7071 18.7071C16.8946 18.5196 17 18.2652 17 18V17C17 16.2044 16.6839 15.4413 16.1213 14.8787C15.5587 14.3161 14.7956 14 14 14H10C9.20435 14 8.44129 14.3161 7.87868 14.8787C7.31607 15.4413 7 16.2044 7 17ZM15 8C15 8.79565 14.6839 9.55871 14.1213 10.1213C13.5587 10.6839 12.7956 11 12 11C11.2044 11 10.4413 10.6839 9.87868 10.1213C9.31607 9.55871 9 8.79565 9 8C9 7.20435 9.31607 6.44129 9.87868 5.87868C10.4413 5.31607 11.2044 5 12 5C12.7956 5 13.5587 5.31607 14.1213 5.87868C14.6839 6.44129 15 7.20435 15 8Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                        />
                                    </svg>
                                    <span>Самостоятельно</span>
                                </li>
                            </ul>
                        </div>
                    </div>
                    <div className="o-main__grid-6 tb-grid">
                        <div className="white-board --tb-block">
                            <p className="white-board__text">
                                Храните слова, записывайте грамматику, <br /> создавайте задания и
                                проходите квизы. <br /> <br /> Всё необходимое для изучения языка{" "}
                                <br /> в одном месте.{" "}
                            </p>
                            <ul className="white-board__list">
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M12 6.02988V19.0299M12 6.02988C9.181 5.19888 7.285 4.95388 3.97101 5.00688C3.71123 5.01186 3.46382 5.11878 3.28217 5.30455C3.10051 5.49032 2.99917 5.74006 3.00001 5.99988V16.9999C3.00001 17.5629 3.46601 18.0139 4.03001 18.0069C7.15201 17.9639 9.048 18.2189 12 19.0299M12 6.02988C14.819 5.19888 16.715 4.95388 20.029 5.00688C20.2888 5.01186 20.5362 5.11878 20.7178 5.30455C20.8995 5.49032 21.0008 5.74006 21 5.99988V16.9999C21 17.5629 20.534 18.0139 19.97 18.0069C16.848 17.9639 14.952 18.2189 12 19.0299"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Словарь</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M9 9C9 8.20435 9.31607 7.44129 9.87868 6.87868C10.4413 6.31607 11.2044 6 12 6M10 21H14M14 18C14 13.9 18 13.1 18 9C18 7.4087 17.3679 5.88258 16.2426 4.75736C15.1174 3.63214 13.5913 3 12 3C10.4087 3 8.88258 3.63214 7.75736 4.75736C6.63214 5.88258 6 7.4087 6 9C6 13 10 14 10 18H14Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Квиз</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M3 6.2V5H14V6.2M8 5V19M5 19H11M13 12.2V11H21V12.2M17 11V19M15.5 19H18.5"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Грамматика</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M5 19V4C5 3.73478 5.10536 3.48043 5.29289 3.29289C5.48043 3.10536 5.73478 3 6 3H18C18.2652 3 18.5196 3.10536 18.7071 3.29289C18.8946 3.48043 19 3.73478 19 4V17H7C6.46957 17 5.96086 17.2107 5.58579 17.5858C5.21071 17.9609 5 18.4696 5 19ZM5 19C5 19.5304 5.21071 20.0391 5.58579 20.4142C5.96086 20.7893 6.46957 21 7 21H19M9 3V17M16 17V21"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Заметки</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M8.0322 12.0002L10.0162 13.9842L14.9762 9.02418M19.5262 14.2962L20.4192 13.4032C20.6035 13.2189 20.7496 13.0002 20.8493 12.7595C20.9491 12.5188 21.0004 12.2607 21.0004 12.0002C21.0004 11.7396 20.9491 11.4816 20.8493 11.2409C20.7496 11.0001 20.6035 10.7814 20.4192 10.5972L19.5262 9.70418C19.342 9.51993 19.1958 9.30119 19.0962 9.06046C18.9965 8.81974 18.9452 8.56173 18.9452 8.30118V7.04018C18.9452 6.51399 18.7362 6.00935 18.3641 5.63728C17.992 5.2652 17.4874 5.05618 16.9612 5.05618H15.6992C15.4386 5.05626 15.1806 5.00499 14.9399 4.9053C14.6991 4.8056 14.4804 4.65945 14.2962 4.47518L13.4032 3.58218C13.219 3.39792 13.0002 3.25175 12.7595 3.15203C12.5188 3.0523 12.2608 3.00098 12.0002 3.00098C11.7396 3.00098 11.4816 3.0523 11.2409 3.15203C11.0002 3.25175 10.7814 3.39792 10.5972 3.58218L9.7042 4.47518C9.51995 4.6594 9.30121 4.80553 9.06049 4.90522C8.81976 5.00491 8.56175 5.0562 8.3012 5.05618H7.0402C6.77957 5.05605 6.52147 5.10727 6.28065 5.20691C6.03982 5.30656 5.82099 5.45268 5.63665 5.63692C5.45232 5.82117 5.30609 6.03993 5.20632 6.2807C5.10655 6.52148 5.0552 6.77955 5.0552 7.04018V8.30218C5.0552 8.82918 4.8462 9.33318 4.4742 9.70518L3.5812 10.5982C3.39694 10.7824 3.25077 11.0011 3.15105 11.2419C3.05133 11.4826 3 11.7406 3 12.0012C3 12.2617 3.05133 12.5198 3.15105 12.7605C3.25077 13.0012 3.39694 13.2199 3.5812 13.4042L4.4742 14.2972C4.8462 14.6692 5.0552 15.1732 5.0552 15.7002V16.9622C5.0552 17.4884 5.26423 17.993 5.6363 18.3651C6.00837 18.7372 6.51301 18.9462 7.0392 18.9462H8.3012C8.8282 18.9462 9.3322 19.1552 9.7042 19.5272L10.5972 20.4202C10.7814 20.6044 11.0002 20.7506 11.2409 20.8503C11.4816 20.9501 11.7396 21.0014 12.0002 21.0014C12.2608 21.0014 12.5188 20.9501 12.7595 20.8503C13.0002 20.7506 13.219 20.6044 13.4032 20.4202L14.2962 19.5272C14.6684 19.1552 15.173 18.9462 15.6992 18.9462H16.9612C17.4874 18.9462 17.992 18.7372 18.3641 18.3651C18.7362 17.993 18.9452 17.4884 18.9452 16.9622V15.7002C18.9452 15.1732 19.1542 14.6682 19.5262 14.2962Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>Задания</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M8.5 11.5L11 14L15 10M21 12C21 13.1819 20.7672 14.3522 20.3149 15.4442C19.8626 16.5361 19.1997 17.5282 18.364 18.364C17.5282 19.1997 16.5361 19.8626 15.4442 20.3149C14.3522 20.7672 13.1819 21 12 21C10.8181 21 9.64778 20.7672 8.55585 20.3149C7.46392 19.8626 6.47177 19.1997 5.63604 18.364C4.80031 17.5282 4.13738 16.5361 3.68508 15.4442C3.23279 14.3522 3 13.1819 3 12C3 9.61305 3.94821 7.32387 5.63604 5.63604C7.32387 3.94821 9.61305 3 12 3C14.3869 3 16.6761 3.94821 18.364 5.63604C20.0518 7.32387 21 9.61305 21 12Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    <span>В своём темпе</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M16 19H20C20.2652 19 20.5196 18.8946 20.7071 18.7071C20.8946 18.5196 21 18.2652 21 18V17C21 16.2044 20.6839 15.4413 20.1213 14.8787C19.5587 14.3161 18.7956 14 18 14H16M13.764 10C14.1691 10.4529 14.7021 10.7721 15.2925 10.9154C15.8829 11.0587 16.503 11.0193 17.0705 10.8025C17.6381 10.5857 18.1265 10.2017 18.471 9.70126C18.8156 9.20083 19.0001 8.60758 19.0001 8C19.0001 7.39243 18.8156 6.79917 18.471 6.29874C18.1265 5.7983 17.6381 5.41428 17.0705 5.19748C16.503 4.98069 15.8829 4.94134 15.2925 5.08464C14.7021 5.22794 14.1691 5.54714 13.764 6M3 18V17C3 16.2044 3.31607 15.4413 3.87868 14.8787C4.44129 14.3161 5.20435 14 6 14H10C10.7956 14 11.5587 14.3161 12.1213 14.8787C12.6839 15.4413 13 16.2044 13 17V18C13 18.2652 12.8946 18.5196 12.7071 18.7071C12.5196 18.8946 12.2652 19 12 19H4C3.73478 19 3.48043 18.8946 3.29289 18.7071C3.10536 18.5196 3 18.2652 3 18ZM11 8C11 8.79565 10.6839 9.55871 10.1213 10.1213C9.55871 10.6839 8.79565 11 8 11C7.20435 11 6.44129 10.6839 5.87868 10.1213C5.31607 9.55871 5 8.79565 5 8C5 7.20435 5.31607 6.44129 5.87868 5.87868C6.44129 5.31607 7.20435 5 8 5C8.79565 5 9.55871 5.31607 10.1213 5.87868C10.6839 6.44129 11 7.20435 11 8Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                            strokeLinecap="round"
                                        />
                                    </svg>
                                    <span>С учителем</span>
                                </li>
                                <li className="white-board__item">
                                    <svg className="icon" viewBox="0 0 24 24" fill="none">
                                        <path
                                            d="M7 17V18C7 18.2652 7.10536 18.5196 7.29289 18.7071C7.48043 18.8946 7.73478 19 8 19H16C16.2652 19 16.5196 18.8946 16.7071 18.7071C16.8946 18.5196 17 18.2652 17 18V17C17 16.2044 16.6839 15.4413 16.1213 14.8787C15.5587 14.3161 14.7956 14 14 14H10C9.20435 14 8.44129 14.3161 7.87868 14.8787C7.31607 15.4413 7 16.2044 7 17ZM15 8C15 8.79565 14.6839 9.55871 14.1213 10.1213C13.5587 10.6839 12.7956 11 12 11C11.2044 11 10.4413 10.6839 9.87868 10.1213C9.31607 9.55871 9 8.79565 9 8C9 7.20435 9.31607 6.44129 9.87868 5.87868C10.4413 5.31607 11.2044 5 12 5C12.7956 5 13.5587 5.31607 14.1213 5.87868C14.6839 6.44129 15 7.20435 15 8Z"
                                            stroke="#1F1E30"
                                            strokeWidth={2}
                                        />
                                    </svg>
                                    <span>Самостоятельно</span>
                                </li>
                            </ul>
                        </div>
                        <div className="board-link --th-fill-red">
                            <svg className="board-link__icon" viewBox="0 0 16 16" fill="none">
                                <path
                                    d="M-1.66559e-06 13.2346L2.70532 16L12.1738 6.32112L12.1738 15.6839L16 15.6839L16 3.91093L16 0L12.1738 -3.345e-07L0.657091 -1.34132e-06L0.65709 3.91092L9.12057 3.91093L-1.66559e-06 13.2346Z"
                                    fill="currentColor"
                                />
                            </svg>
                            {/* <a href="#" className="board-link__elem">
                                Регистрация
                            </a> */}
                            <Link className="board-link__elem" to="/registration">Регистрация</Link>
                        </div>
                    </div>
                    <div className="o-main__grid-7 tb-grid">
                        <div className="board-link --th-small --th-fill-stroke">
                            <svg className="board-link__icon" viewBox="0 0 24 24" fill="none">
                                <path
                                    d="M3.5 5.5L11.393 11.536C11.5673 11.6692 11.7806 11.7413 12 11.7413C12.2194 11.7413 12.4327 11.6692 12.607 11.536L20.5 5.5M4 19H20C20.2652 19 20.5196 18.8946 20.7071 18.7071C20.8946 18.5196 21 18.2652 21 18V6C21 5.73478 20.8946 5.48043 20.7071 5.29289C20.5196 5.10536 20.2652 5 20 5H4C3.73478 5 3.48043 5.10536 3.29289 5.29289C3.10536 5.48043 3 5.73478 3 6V18C3 18.2652 3.10536 18.5196 3.29289 18.7071C3.48043 18.8946 3.73478 19 4 19Z"
                                    stroke="currentColor"
                                    strokeWidth={2}
                                    strokeLinecap="round"
                                />
                            </svg>
                            <Link className="board-link__elem" to="/">Обратная связь</Link>
                            {/* <a href="#" className="board-link__elem">
                                Обратная связь
                            </a> */}
                        </div>
                        <div className="image-board" />
                    </div>
                </div>
            </main>
        </>

    )
}